Maxjta/hal_at32/include/dt-bindings/pinctrl/at32f405r(c-g-m)xx-pinctrl.h
/* I2C2_SDA */
#define I2C2_SDA_PA1 \
	AT32_PINMUX_AF('A', 1, AF4)
#define I2C2_SDA_PA12 \
	AT32_PINMUX_AF('A', 12, AF4)
#define I2C2_SDA_PB11 \
	AT32_PINMUX_AF('B', 11, AF4)
#define I2C2_SDA_PB3 \
	AT32_PINMUX_AF('B', 3, AF4)
#define I2C2_SDA_PB9 \
	AT32_PINMUX_AF('B', 9, AF7)
#define I2C2_SDA_PH3 \
	AT32_PINMUX_AF('H', 3, AF4)

/* I2C2_SMBA */
#define I2C2_SMBA_PB12 \
	AT32_PINMUX_AF('B', 12, AF4)

/* I2C3_SCL */
#define I2C3_SCL_PA8 \
	AT32_PINMUX_AF('A', 8, AF4)
#define I2C3_SCL_PB13 \
	AT32_PINMUX_AF('B', 13, AF7)
#define I2C3_SCL_PB15 \
	AT32_PINMUX_AF('B', 15, AF4)

/* I2C3_SDA */
#define I2C3_SDA_PB14 \
	AT32_PINMUX_AF('B', 14, AF4)
#define I2C3_SDA_PB4 \
	AT32_PINMUX_AF('B', 4, AF4)

/* I2C3_SMBA */
#define I2C3_SMBA_PA9 \
	AT32_PINMUX_AF('A', 9, AF4)
#define I2C3_SMBA_PB13 \
	AT32_PINMUX_AF('B', 13, AF4)
#define I2C3_SMBA_PB2 \
	AT32_PINMUX_AF('B', 2, AF4)

/* I2S1_CK */
#define I2S1_CK_PA5 \
	AT32_PINMUX_AF('A', 5, AF5)
#define I2S1_CK_PB3 \
	AT32_PINMUX_AF('B', 3, AF5)

/* I2S1_MCK */
#define I2S1_MCK_PB0 \
	AT32_PINMUX_AF('B', 0, AF5)
#define I2S1_MCK_PB6 \
	AT32_PINMUX_AF('B', 6, AF5)

/* I2S1_SDEXT */
#define I2S1_SDEXT_PA7 \
	AT32_PINMUX_AF('A', 7, AF5)
#define I2S1_SDEXT_PB5 \
	AT32_PINMUX_AF('B', 5, AF5)

/* I2S1_WS */
#define I2S1_WS_PA15 \
	AT32_PINMUX_AF('A', 15, AF5)
#define I2S1_WS_PA4 \
	AT32_PINMUX_AF('A', 4, AF5)

/* I2S2_CK */
#define I2S2_CK_PA9 \
	AT32_PINMUX_AF('A', 9, AF5)
#define I2S2_CK_PB1 \
	AT32_PINMUX_AF('B', 1, AF6)
#define I2S2_CK_PB10 \
	AT32_PINMUX_AF('B', 10, AF5)
#define I2S2_CK_PB13 \
	AT32_PINMUX_AF('B', 13, AF5)

/* I2S2_MCK */
#define I2S2_MCK_PA3 \
	AT32_PINMUX_AF('A', 3, AF5)
#define I2S2_MCK_PA6 \
	AT32_PINMUX_AF('A', 6, AF6)

/* I2S2_SDEXT */
#define I2S2_SDEXT_PA10 \
	AT32_PINMUX_AF('A', 10, AF5)
#define I2S2_SDEXT_PB14 \
	AT32_PINMUX_AF('B', 14, AF6)
#define I2S2_SDEXT_PB15 \
	AT32_PINMUX_AF('B', 15, AF5)

/* I2S2_WS */
#define I2S2_WS_PA11 \
	AT32_PINMUX_AF('A', 11, AF5)
#define I2S2_WS_PB12 \
	AT32_PINMUX_AF('B', 12, AF5)
#define I2S2_WS_PB9 \
	AT32_PINMUX_AF('B', 9, AF5)

/* I2S3_CK */
#define I2S3_CK_PB12 \
	AT32_PINMUX_AF('B', 12, AF7)
#define I2S3_CK_PB3 \
	AT32_PINMUX_AF('B', 3, AF6)

/* I2S3_MCK */
#define I2S3_MCK_PB10 \
	AT32_PINMUX_AF('B', 10, AF6)

/* I2S3_SDEXT */
#define I2S3_SDEXT_PA14 \
	AT32_PINMUX_AF('A', 14, AF6)
#define I2S3_SDEXT_PB0 \
	AT32_PINMUX_AF('B', 0, AF7)
#define I2S3_SDEXT_PB2 \
	AT32_PINMUX_AF('B', 2, AF7)
#define I2S3_SDEXT_PB4 \
	AT32_PINMUX_AF('B', 4, AF7)
#define I2S3_SDEXT_PB5 \
	AT32_PINMUX_AF('B', 5, AF6)

/* I2S3_WS */
#define I2S3_WS_PA15 \
	AT32_PINMUX_AF('A', 15, AF6)
#define I2S3_WS_PA4 \
	AT32_PINMUX_AF('A', 4, AF6)

/* I2S4_CK */
#define I2S4_CK_PB13 \
	AT32_PINMUX_AF('B', 13, AF6)
#define I2S4_CK_PB7 \
	AT32_PINMUX_AF('B', 7, AF6)

/* I2S4_MCK */
#define I2S4_MCK_PA10 \
	AT32_PINMUX_AF('A', 10, AF6)

/* I2S4_SDEXT */
#define I2S4_SDEXT_PA1 \
	AT32_PINMUX_AF('A', 1, AF5)
#define I2S4_SDEXT_PB9 \
	AT32_PINMUX_AF('B', 9, AF6)

/* I2S4_WS */
#define I2S4_WS_PB12 \
	AT32_PINMUX_AF('B', 12, AF6)
#define I2S4_WS_PB6 \
	AT32_PINMUX_AF('B', 6, AF6)

/* IR_OUT */
#define IR_OUT_PA13 \
	AT32_PINMUX_AF('A', 13, AF1)
#define IR_OUT_PB9 \
	AT32_PINMUX_AF('B', 9, AF0)

/* JNTRST */
#define JNTRST_PB4 \
	AT32_PINMUX_AF('B', 4, AF0)

/* JTCK */
#define JTCK_PA14 \
	AT32_PINMUX_AF('A', 14, AF0)

/* JTDI */
#define JTDI_PA15 \
	AT32_PINMUX_AF('A', 15, AF0)

/* JTDO */
#define JTDO_PB3 \
	AT32_PINMUX_AF('B', 3, AF0)

/* JTMS */
#define JTMS_PA13 \
	AT32_PINMUX_AF('A', 13, AF0)

/* OTG1_D+ */
#define OTG1_DP_PA12 \
	AT32_PINMUX_AF('A', 12, AF10)

/* OTG1_D- */
#define OTG1_DM_PA11 \
	AT32_PINMUX_AF('A', 11, AF10)

/* OTG1_ID */
#define OTG1_ID_PA10 \
	AT32_PINMUX_AF('A', 10, AF10)

/* OTG1_OE */
#define OTG1_OE_PA13 \
	AT32_PINMUX_AF('A', 13, AF10)

/* OTG1_SOF */
#define OTG1_SOF_PA8 \
	AT32_PINMUX_AF('A', 8, AF10)

/* OTG1_VBUS */
#define OTG1_VBUS_PA9 \
	AT32_PINMUX_AF('A', 9, AF10)

/* OTG2_D+ */
#define OTG2_DP_PB15 \
	AT32_PINMUX_AF('B', 15, AF12)

/* OTG2_D- */
#define OTG2_DM_PB14 \
	AT32_PINMUX_AF('B', 14, AF12)

/* OTG2_ID */
#define OTG2_ID_PB12 \
	AT32_PINMUX_AF('B', 12, AF12)

/* OTG2_SOF */
#define OTG2_SOF_PA4 \
	AT32_PINMUX_AF('A', 4, AF12)

/* OTG2_VBUS */
#define OTG2_VBUS_PB13 \
	AT32_PINMUX_AF('B', 13, AF12)

/* QSPI1_CS */
#define QSPI1_CS_PB10 \
	AT32_PINMUX_AF('B', 10, AF9)
#define QSPI1_CS_PB6 \
	AT32_PINMUX_AF('B', 6, AF10)
#define QSPI1_CS_PB9 \
	AT32_PINMUX_AF('B', 9, AF10)

/* QSPI1_IO0 */
#define QSPI1_IO0_PA6 \
	AT32_PINMUX_AF('A', 6, AF10)
#define QSPI1_IO0_PB0 \
	AT32_PINMUX_AF('B', 0, AF10)
#define QSPI1_IO0_PB11 \
	AT32_PINMUX_AF('B', 11, AF10)
#define QSPI1_IO0_PH2 \
	AT32_PINMUX_AF('H', 2, AF10)

/* QSPI1_IO1 */
#define QSPI1_IO1_PA7 \
	AT32_PINMUX_AF('A', 7, AF10)
#define QSPI1_IO1_PB10 \
	AT32_PINMUX_AF('B', 10, AF10)
#define QSPI1_IO1_PH3 \
	AT32_PINMUX_AF('H', 3, AF10)

/* QSPI1_IO2 */
#define QSPI1_IO2_PA15 \
	AT32_PINMUX_AF('A', 15, AF10)

/* QSPI1_IO3 */
#define QSPI1_IO3_PA1 \
	AT32_PINMUX_AF('A', 1, AF9)
#define QSPI1_IO3_PB3 \
	AT32_PINMUX_AF('B', 3, AF10)

/* QSPI1_SCK */
#define QSPI1_SCK_PB1 \
	AT32_PINMUX_AF('B', 1, AF9)
#define QSPI1_SCK_PB2 \
	AT32_PINMUX_AF('B', 2, AF9)

/* QSPI2_CS */
#define QSPI2_CS_PB8 \
	AT32_PINMUX_AF('B', 8, AF10)

/* QSPI2_IO0 */
#define QSPI2_IO0_PB0 \
	AT32_PINMUX_AF('B', 0, AF9)

/* QSPI2_IO1 */
#define QSPI2_IO1_PA15 \
	AT32_PINMUX_AF('A', 15, AF9)
#define QSPI2_IO1_PB7 \
	AT32_PINMUX_AF('B', 7, AF9)

/* QSPI2_IO2 */
#define QSPI2_IO2_PA5 \
	AT32_PINMUX_AF('A', 5, AF9)

/* QSPI2_IO3 */
#define QSPI2_IO3_PA3 \
	AT32_PINMUX_AF('A', 3, AF9)

/* QSPI2_SCK */
#define QSPI2_SCK_PB1 \
	AT32_PINMUX_AF('B', 1, AF10)

/* SDIO1_CK */
#define SDIO1_CK_PB15 \
	AT32_PINMUX_AF('B', 15, AF13)
#define SDIO1_CK_PB2 \
	AT32_PINMUX_AF('B', 2, AF12)

/* SDIO1_CMD */
#define SDIO1_CMD_PA6 \
	AT32_PINMUX_AF('A', 6, AF12)

/* SDIO1_D0 */
#define SDIO1_D0_PB4 \
	AT32_PINMUX_AF('B', 4, AF12)
#define SDIO1_D0_PB6 \
	AT32_PINMUX_AF('B', 6, AF14)
#define SDIO1_D0_PB7 \
	AT32_PINMUX_AF('B', 7, AF14)

