Maxjta/hal_at32/include/dt-bindings/pinctrl/at32f405r(c-g-m)xx-pinctrl.h
/* SDIO1_D1 */
#define SDIO1_D1_PA8 \
	AT32_PINMUX_AF('A', 8, AF12)
#define SDIO1_D1_PB0 \
	AT32_PINMUX_AF('B', 0, AF12)

/* SDIO1_D2 */
#define SDIO1_D2_PA9 \
	AT32_PINMUX_AF('A', 9, AF12)
#define SDIO1_D2_PB1 \
	AT32_PINMUX_AF('B', 1, AF12)

/* SDIO1_D3 */
#define SDIO1_D3_PB5 \
	AT32_PINMUX_AF('B', 5, AF14)

/* SDIO1_D4 */
#define SDIO1_D4_PB8 \
	AT32_PINMUX_AF('B', 8, AF12)

/* SDIO1_D5 */
#define SDIO1_D5_PB9 \
	AT32_PINMUX_AF('B', 9, AF12)

/* SDIO1_D6 */
#define SDIO1_D6_PB14 \
	AT32_PINMUX_AF('B', 14, AF13)

/* SDIO1_D7 */
#define SDIO1_D7_PB10 \
	AT32_PINMUX_AF('B', 10, AF12)

/* SDIO2_CK */
#define SDIO2_CK_PA2 \
	AT32_PINMUX_AF('A', 2, AF10)

/* SDIO2_CMD */
#define SDIO2_CMD_PA3 \
	AT32_PINMUX_AF('A', 3, AF10)

/* SDIO2_D0 */
#define SDIO2_D0_PA4 \
	AT32_PINMUX_AF('A', 4, AF11)

/* SDIO2_D1 */
#define SDIO2_D1_PA5 \
	AT32_PINMUX_AF('A', 5, AF11)

/* SDIO2_D2 */
#define SDIO2_D2_PA6 \
	AT32_PINMUX_AF('A', 6, AF11)

/* SDIO2_D3 */
#define SDIO2_D3_PA7 \
	AT32_PINMUX_AF('A', 7, AF13)

/* SDIO2_D4 */
#define SDIO2_D4_PA4 \
	AT32_PINMUX_AF('A', 4, AF10)

/* SDIO2_D5 */
#define SDIO2_D5_PA5 \
	AT32_PINMUX_AF('A', 5, AF10)

/* SDIO2_D6 */
#define SDIO2_D6_PA6 \
	AT32_PINMUX_AF('A', 6, AF14)

/* SDIO2_D7 */
#define SDIO2_D7_PA7 \
	AT32_PINMUX_AF('A', 7, AF14)

/* SPI1_CS */
#define SPI1_CS_PA15 \
	AT32_PINMUX_AF('A', 15, AF5)
#define SPI1_CS_PA4 \
	AT32_PINMUX_AF('A', 4, AF5)

/* SPI1_MISO */
#define SPI1_MISO_PA6 \
	AT32_PINMUX_AF('A', 6, AF5)
#define SPI1_MISO_PB0 \
	AT32_PINMUX_AF('B', 0, AF5)
#define SPI1_MISO_PB4 \
	AT32_PINMUX_AF('B', 4, AF5)

/* SPI1_MOSI */
#define SPI1_MOSI_PA7 \
	AT32_PINMUX_AF('A', 7, AF5)
#define SPI1_MOSI_PB1 \
	AT32_PINMUX_AF('B', 1, AF5)
#define SPI1_MOSI_PB5 \
	AT32_PINMUX_AF('B', 5, AF5)

/* SPI1_SCK */
#define SPI1_SCK_PA5 \
	AT32_PINMUX_AF('A', 5, AF5)
#define SPI1_SCK_PB3 \
	AT32_PINMUX_AF('B', 3, AF5)

/* SPI2_CS */
#define SPI2_CS_PA11 \
	AT32_PINMUX_AF('A', 11, AF5)
#define SPI2_CS_PB12 \
	AT32_PINMUX_AF('B', 12, AF5)
#define SPI2_CS_PB9 \
	AT32_PINMUX_AF('B', 9, AF5)

/* SPI2_MISO */
#define SPI2_MISO_PA12 \
	AT32_PINMUX_AF('A', 12, AF5)
#define SPI2_MISO_PB14 \
	AT32_PINMUX_AF('B', 14, AF5)
#define SPI2_MISO_PC2 \
	AT32_PINMUX_AF('C', 2, AF5)

/* SPI2_MOSI */
#define SPI2_MOSI_PA10 \
	AT32_PINMUX_AF('A', 10, AF5)
#define SPI2_MOSI_PB15 \
	AT32_PINMUX_AF('B', 15, AF5)
#define SPI2_MOSI_PC1 \
	AT32_PINMUX_AF('C', 1, AF6)
#define SPI2_MOSI_PC3 \
	AT32_PINMUX_AF('C', 3, AF5)

/* SPI2_SCK */
#define SPI2_SCK_PA9 \
	AT32_PINMUX_AF('A', 9, AF5)
#define SPI2_SCK_PB1 \
	AT32_PINMUX_AF('B', 1, AF6)
#define SPI2_SCK_PB10 \
	AT32_PINMUX_AF('B', 10, AF5)
#define SPI2_SCK_PB13 \
	AT32_PINMUX_AF('B', 13, AF5)
#define SPI2_SCK_PC7 \
	AT32_PINMUX_AF('C', 7, AF5)

/* SPI3_CS */
#define SPI3_CS_PA15 \
	AT32_PINMUX_AF('A', 15, AF6)
#define SPI3_CS_PA4 \
	AT32_PINMUX_AF('A', 4, AF6)

/* SPI3_MISO */
#define SPI3_MISO_PA13 \
	AT32_PINMUX_AF('A', 13, AF6)
#define SPI3_MISO_PB4 \
	AT32_PINMUX_AF('B', 4, AF6)
#define SPI3_MISO_PC11 \
	AT32_PINMUX_AF('C', 11, AF6)

/* SPI3_MOSI */
#define SPI3_MOSI_PA14 \
	AT32_PINMUX_AF('A', 14, AF6)
#define SPI3_MOSI_PB0 \
	AT32_PINMUX_AF('B', 0, AF6)
#define SPI3_MOSI_PB2 \
	AT32_PINMUX_AF('B', 2, AF6)
#define SPI3_MOSI_PB5 \
	AT32_PINMUX_AF('B', 5, AF6)
#define SPI3_MOSI_PC1 \
	AT32_PINMUX_AF('C', 1, AF5)
#define SPI3_MOSI_PC12 \
	AT32_PINMUX_AF('C', 12, AF6)

/* SPI3_SCK */
#define SPI3_SCK_PB12 \
	AT32_PINMUX_AF('B', 12, AF6)
#define SPI3_SCK_PB3 \
	AT32_PINMUX_AF('B', 3, AF6)
#define SPI3_SCK_PC10 \
	AT32_PINMUX_AF('C', 10, AF6)

/* SPI4_CS */
#define SPI4_CS_PB12 \
	AT32_PINMUX_AF('B', 12, AF6)
#define SPI4_CS_PB6 \
	AT32_PINMUX_AF('B', 6, AF6)

/* SPI4_MISO */
#define SPI4_MISO_PA11 \
	AT32_PINMUX_AF('A', 11, AF6)
#define SPI4_MISO_PB8 \
	AT32_PINMUX_AF('B', 8, AF6)

/* SPI4_MOSI */
#define SPI4_MOSI_PA1 \
	AT32_PINMUX_AF('A', 1, AF5)
#define SPI4_MOSI_PB9 \
	AT32_PINMUX_AF('B', 9, AF6)

/* SPI4_SCK */
#define SPI4_SCK_PB13 \
	AT32_PINMUX_AF('B', 13, AF6)
#define SPI4_SCK_PB7 \
	AT32_PINMUX_AF('B', 7, AF6)

/* SWCLK */
#define SWCLK_PA14 \
	AT32_PINMUX_AF('A', 14, AF0)

/* SWDIO */
#define SWDIO_PA13 \
	AT32_PINMUX_AF('A', 13, AF0)

/* SWO */
#define SWO_PB3 \
	AT32_PINMUX_AF('B', 3, AF0)

/* TMR1_BRK */
#define TMR1_BRK_PA6 \
	AT32_PINMUX_AF('A', 6, AF1)
#define TMR1_BRK_PB12 \
	AT32_PINMUX_AF('B', 12, AF1)

/* TMR1_CH1 */
#define TMR1_CH1_PA8 \
	AT32_PINMUX_AF('A', 8, AF1)

/* TMR1_CH1C */
#define TMR1_CH1C_PA7 \
	AT32_PINMUX_AF('A', 7, AF1)
#define TMR1_CH1C_PB13 \
	AT32_PINMUX_AF('B', 13, AF1)

/* TMR1_CH2 */
#define TMR1_CH2_PA9 \
	AT32_PINMUX_AF('A', 9, AF1)

/* TMR1_CH2C */
#define TMR1_CH2C_PB0 \
	AT32_PINMUX_AF('B', 0, AF1)
#define TMR1_CH2C_PB14 \
	AT32_PINMUX_AF('B', 14, AF1)

/* TMR1_CH3 */
#define TMR1_CH3_PA10 \
	AT32_PINMUX_AF('A', 10, AF1)

/* TMR1_CH3C */
#define TMR1_CH3C_PB1 \
	AT32_PINMUX_AF('B', 1, AF1)
#define TMR1_CH3C_PB15 \
	AT32_PINMUX_AF('B', 15, AF1)

/* TMR1_CH4 */
#define TMR1_CH4_PA11 \
	AT32_PINMUX_AF('A', 11, AF1)

/* TMR1_EXT */
#define TMR1_EXT_PA12 \
	AT32_PINMUX_AF('A', 12, AF1)

/* TMR20_CH1 */
#define TMR20_CH1_PB2 \
	AT32_PINMUX_AF('B', 2, AF2)

/* TMR2_CH1 */
#define TMR2_CH1_PA0 \
	AT32_PINMUX_AF('A', 0, AF1)
#define TMR2_CH1_PA15 \
	AT32_PINMUX_AF('A', 15, AF1)
#define TMR2_CH1_PA5 \
	AT32_PINMUX_AF('A', 5, AF1)
#define TMR2_CH1_PB8 \
	AT32_PINMUX_AF('B', 8, AF1)
#define TMR2_CH1_PF4 \
	AT32_PINMUX_AF('F', 4, AF1)

/* TMR2_CH2 */
#define TMR2_CH2_PA1 \
	AT32_PINMUX_AF('A', 1, AF1)
#define TMR2_CH2_PB3 \
	AT32_PINMUX_AF('B', 3, AF1)
#define TMR2_CH2_PB9 \
	AT32_PINMUX_AF('B', 9, AF1)
#define TMR2_CH2_PF5 \
	AT32_PINMUX_AF('F', 5, AF1)

/* TMR2_CH3 */
#define TMR2_CH3_PA2 \
	AT32_PINMUX_AF('A', 2, AF1)
#define TMR2_CH3_PB10 \
	AT32_PINMUX_AF('B', 10, AF1)

/* TMR2_CH4 */
#define TMR2_CH4_PA3 \
	AT32_PINMUX_AF('A', 3, AF1)
#define TMR2_CH4_PB2 \
	AT32_PINMUX_AF('B', 2, AF1)

/* TMR2_EXT */
#define TMR2_EXT_PA0 \
	AT32_PINMUX_AF('A', 0, AF1)
#define TMR2_EXT_PA15 \
	AT32_PINMUX_AF('A', 15, AF1)
#define TMR2_EXT_PA5 \
	AT32_PINMUX_AF('A', 5, AF1)
#define TMR2_EXT_PB8 \
	AT32_PINMUX_AF('B', 8, AF1)

/* TMR3_CH1 */
#define TMR3_CH1_PA6 \
	AT32_PINMUX_AF('A', 6, AF2)
#define TMR3_CH1_PB4 \
	AT32_PINMUX_AF('B', 4, AF2)
#define TMR3_CH1_PC6 \
	AT32_PINMUX_AF('C', 6, AF2)

/* TMR3_CH2 */
#define TMR3_CH2_PA7 \
	AT32_PINMUX_AF('A', 7, AF2)
#define TMR3_CH2_PB5 \
	AT32_PINMUX_AF('B', 5, AF2)
#define TMR3_CH2_PC7 \
	AT32_PINMUX_AF('C', 7, AF2)

