Maxjta/hal_at32/include/dt-bindings/pinctrl/at32f405r(c-g-m)xx-pinctrl.h
/* TMR3_CH3 */
#define TMR3_CH3_PB0 \
	AT32_PINMUX_AF('B', 0, AF2)
	#define TMR3_CH3_PC8 \
	AT32_PINMUX_AF('C', 8, AF2)

/* TMR3_CH4 */
#define TMR3_CH4_PB1 \
	AT32_PINMUX_AF('B', 1, AF2)
#define TMR3_CH4_PC9 \
	AT32_PINMUX_AF('C', 9, AF2)
	
#define TMR3_EXT_PB2 \
	AT32_PINMUX_AF('B', 2, AF2)
#define TMR3_EXT_PD2 \
	AT32_PINMUX_AF('D', 2, AF2)

/* TMR4_CH1 */
#define TMR4_CH1_PB6 \
	AT32_PINMUX_AF('B', 6, AF2)

/* TMR4_CH2 */
#define TMR4_CH2_PB7 \
	AT32_PINMUX_AF('B', 7, AF2)

/* TMR4_CH3 */
#define TMR4_CH3_PB8 \
	AT32_PINMUX_AF('B', 8, AF2)

/* TMR4_CH4 */
#define TMR4_CH4_PB9 \
	AT32_PINMUX_AF('B', 9, AF2)

/* TMR5_CH1 */
#define TMR5_CH1_PA0 \
	AT32_PINMUX_AF('A', 0, AF2)
#define TMR5_CH1_PB12 \
	AT32_PINMUX_AF('B', 12, AF2)
#define TMR5_CH1_PH2 \
	AT32_PINMUX_AF('H', 2, AF2)

/* TMR5_CH2 */
#define TMR5_CH2_PA1 \
	AT32_PINMUX_AF('A', 1, AF2)
#define TMR5_CH2_PH3 \
	AT32_PINMUX_AF('H', 3, AF2)

/* TMR5_CH3 */
#define TMR5_CH3_PA2 \
	AT32_PINMUX_AF('A', 2, AF2)

/* TMR5_CH4 */
#define TMR5_CH4_PA3 \
	AT32_PINMUX_AF('A', 3, AF2)
#define TMR5_CH4_PB11 \
	AT32_PINMUX_AF('B', 11, AF2)

/* TMR8_BRK */
#define TMR8_BRK_PA6 \
	AT32_PINMUX_AF('A', 6, AF3)
#define TMR8_BRK_PB7 \
	AT32_PINMUX_AF('B', 7, AF3)

/* TMR8_CH1C */
#define TMR8_CH1C_PA5 \
	AT32_PINMUX_AF('A', 5, AF3)
#define TMR8_CH1C_PA7 \
	AT32_PINMUX_AF('A', 7, AF3)

/* TMR8_CH2C */
#define TMR8_CH2C_PB0 \
	AT32_PINMUX_AF('B', 0, AF3)
#define TMR8_CH2C_PB14 \
	AT32_PINMUX_AF('B', 14, AF3)

/* TMR8_CH3C */
#define TMR8_CH3C_PB1 \
	AT32_PINMUX_AF('B', 1, AF3)
#define TMR8_CH3C_PB15 \
	AT32_PINMUX_AF('B', 15, AF3)

/* TMR8_EXT */
#define TMR8_EXT_PA0 \
	AT32_PINMUX_AF('A', 0, AF3)

/* TMR9_CH1 */
#define TMR9_CH1_PA2 \
	AT32_PINMUX_AF('A', 2, AF3)
#define TMR9_CH1_PC4 \
	AT32_PINMUX_AF('C', 4, AF3)
	
#define TMR9_CH1C_PA1 \
	AT32_PINMUX_AF('A', 1, AF3)

/* TMR9_CH2 */
#define TMR9_CH2_PA3 \
	AT32_PINMUX_AF('A', 3, AF3)
#define TMR9_CH2_PC5 \
	AT32_PINMUX_AF('C', 5, AF3)
#define TMR9_CH2C_PA0 \
	AT32_PINMUX_AF('A', 0, AF3)

#define TMR9_BRK_PA8 \
	AT32_PINMUX_AF('A', 8, AF3)

/* TMR10_CH1 */
#define TMR10_CH1_PB8 \
	AT32_PINMUX_AF('B', 8, AF3)
#define TMR10_CH1C_PB6 \
	AT32_PINMUX_AF('B', 6, AF3)
#define TMR10_BRK_PB5 \
	AT32_PINMUX_AF('B', 5, AF3)
	
/* TMR11_CH1 */
#define TMR11_CH1_PB9 \
	AT32_PINMUX_AF('B', 9, AF3)
#define TMR11_CH1_PC12 \
	AT32_PINMUX_AF('C', 12, AF3)
#define TMR11_CH1C_PB7 \
	AT32_PINMUX_AF('B', 7, AF3)
#define TMR11_BRK_PB4 \
	AT32_PINMUX_AF('B', 4, AF3)

/* TMR12_CH1 */
#define TMR12_CH1_PB14 \
	AT32_PINMUX_AF('B', 14, AF9)

/* TMR12_CH2 */
#define TMR12_CH2_PB15 \
	AT32_PINMUX_AF('B', 15, AF9)

/* TMR13_CH1 */
#define TMR13_CH1_PA6 \
	AT32_PINMUX_AF('A', 6, AF9)
#define TMR13_CH1_PC4 \
	AT32_PINMUX_AF('C', 4, AF9)
#define TMR13_CH1C_PA5 \
	AT32_PINMUX_AF('A', 5, AF9)
#define TMR13_CH1C_PC5 \
	AT32_PINMUX_AF('C', 5, AF9)

/* TMR14_CH1 */
#define TMR14_CH1_PA7 \
	AT32_PINMUX_AF('A', 7, AF9)
#define TMR14_CH1_PA4 \
	AT32_PINMUX_AF('A', 4, AF9)
#define TMR14_CH1_PB1 \
	AT32_PINMUX_AF('B', 1, AF9)
#define TMR14_CH1C_PB2 \
	AT32_PINMUX_AF('B', 2, AF9)
#define TMR14_BRK_PA9 \
	AT32_PINMUX_AF('A', 9, AF9)
	
/* UART4_RX */
#define UART4_RX_PA1 \
	AT32_PINMUX_AF('A', 1, AF8)
#define UART4_RX_PH2 \
	AT32_PINMUX_AF('H', 2, AF8)

/* UART4_TX */
#define UART4_TX_PA0 \
	AT32_PINMUX_AF('A', 0, AF8)
#define UART4_TX_PH3 \
	AT32_PINMUX_AF('H', 3, AF8)

/* UART5_RX */
#define UART5_RX_PB5 \
	AT32_PINMUX_AF('B', 5, AF8)
#define UART5_RX_PB8 \
	AT32_PINMUX_AF('B', 8, AF8)

/* UART5_TX */
#define UART5_TX_PB6 \
	AT32_PINMUX_AF('B', 6, AF8)
#define UART5_TX_PB9 \
	AT32_PINMUX_AF('B', 9, AF8)

/* UART7_RX */
#define UART7_RX_PB3 \
	AT32_PINMUX_AF('B', 3, AF8)

/* UART7_TX */
#define UART7_TX_PB4 \
	AT32_PINMUX_AF('B', 4, AF8)

/* USART1_CK */
#define USART1_CK_PA8 \
	AT32_PINMUX_AF('A', 8, AF7)
#define USART1_CK_PB5 \
	AT32_PINMUX_AF('B', 5, AF7)

/* USART1_CTS */
#define USART1_CTS_PA11 \
	AT32_PINMUX_AF('A', 11, AF7)

/* USART1_RTS_DE */
#define USART1_RTS_DE_PA12 \
	AT32_PINMUX_AF('A', 12, AF7)

/* USART1_RX */
#define USART1_RX_PA10 \
	AT32_PINMUX_AF('A', 10, AF7)
#define USART1_RX_PB3 \
	AT32_PINMUX_AF('B', 3, AF7)
#define USART1_RX_PB7 \
	AT32_PINMUX_AF('B', 7, AF7)

/* USART1_TX */
#define USART1_TX_PA15 \
	AT32_PINMUX_AF('A', 15, AF7)
#define USART1_TX_PA9 \
	AT32_PINMUX_AF('A', 9, AF7)
#define USART1_TX_PB6 \
	AT32_PINMUX_AF('B', 6, AF7)

/* USART2_CK */
#define USART2_CK_PA4 \
	AT32_PINMUX_AF('A', 4, AF7)

/* USART2_CTS */
#define USART2_CTS_PA0 \
	AT32_PINMUX_AF('A', 0, AF7)

/* USART2_RTS_DE */
#define USART2_RTS_DE_PA1 \
	AT32_PINMUX_AF('A', 1, AF7)

/* USART2_RX */
#define USART2_RX_PA15 \
	AT32_PINMUX_AF('A', 15, AF8)
#define USART2_RX_PA3 \
	AT32_PINMUX_AF('A', 3, AF7)
#define USART2_RX_PB0 \
	AT32_PINMUX_AF('B', 0, AF6)

/* USART2_TX */
#define USART2_TX_PA14 \
	AT32_PINMUX_AF('A', 14, AF8)
#define USART2_TX_PA2 \
	AT32_PINMUX_AF('A', 2, AF7)
#define USART2_TX_PA8 \
	AT32_PINMUX_AF('A', 8, AF8)

/* USART3_CK */
#define USART3_CK_PB0 \
	AT32_PINMUX_AF('B', 0, AF8)
#define USART3_CK_PB12 \
	AT32_PINMUX_AF('B', 12, AF8)

/* USART3_CTS */
#define USART3_CTS_PA6 \
	AT32_PINMUX_AF('A', 6, AF7)
#define USART3_CTS_PB13 \
	AT32_PINMUX_AF('B', 13, AF8)

/* USART3_RTS_DE */
#define USART3_RTS_DE_PB1 \
	AT32_PINMUX_AF('B', 1, AF8)
#define USART3_RTS_DE_PB14 \
	AT32_PINMUX_AF('B', 14, AF7)

/* USART3_RX */
#define USART3_RX_PB11 \
	AT32_PINMUX_AF('B', 11, AF7)

/* USART3_TX */
#define USART3_TX_PB10 \
	AT32_PINMUX_AF('B', 10, AF7)

/* USART6_RX */
#define USART6_RX_PA12 \
	AT32_PINMUX_AF('A', 12, AF8)
#define USART6_RX_PA5 \
	AT32_PINMUX_AF('A', 5, AF8)

/* USART6_TX */
#define USART6_TX_PA11 \
	AT32_PINMUX_AF('A', 11, AF8)
#define USART6_TX_PA4 \
	AT32_PINMUX_AF('A', 4, AF8)

/* XMC_A4 */
#define XMC_A4_PA8 \
	AT32_PINMUX_AF('A', 8, AF14)

/* XMC_D0 */
#define XMC_D0_PB14 \
	AT32_PINMUX_AF('B', 14, AF14)

/* XMC_D13 */
#define XMC_D13_PB12 \
	AT32_PINMUX_AF('B', 12, AF14)

/* XMC_D4 */
#define XMC_D4_PA2 \
	AT32_PINMUX_AF('A', 2, AF14)

/* XMC_D5 */
#define XMC_D5_PA3 \
	AT32_PINMUX_AF('A', 3, AF14)

/* XMC_D6 */
#define XMC_D6_PA4 \
	AT32_PINMUX_AF('A', 4, AF14)

/* XMC_D7 */
#define XMC_D7_PA5 \
	AT32_PINMUX_AF('A', 5, AF14)

/* XMC_NADV */
#define XMC_NADV_PB7 \
	AT32_PINMUX_AF('B', 7, AF12)

/* XMC_NCE3 */
#define XMC_NCE3_PA15 \
	AT32_PINMUX_AF('A', 15, AF12)

/* XMC_NE2 */
#define XMC_NE2_PA15 \
	AT32_PINMUX_AF('A', 15, AF12)

/* XMC_NOE */
#define XMC_NOE_PB10 \
	AT32_PINMUX_AF('B', 10, AF14)

/* XMC_SDCKE1 */
#define XMC_SDCKE1_PB5 \
	AT32_PINMUX_AF('B', 5, AF12)

/* XMC_SDCS1 */
#define XMC_SDCS1_PB6 \
	AT32_PINMUX_AF('B', 6, AF12)

/* XMC_SDNWE */
#define XMC_SDNWE_PA7 \
	AT32_PINMUX_AF('A', 7, AF12)
